<?php

namespace Database\Seeders;

use App\Models\CasteCategory;
use App\Models\Caste;
// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        $casteData = [
            'पहाडी दलित' => [
                'नवश्वकमान', 'नमजार', 'परियार', 'सार्की', 'डोम', 'गन्धर्व', 'गाईने',
                'बारि', 'जोम', 'गन्र्वन (गाईने)', 'अन्य'
            ],

            'पहाडी जनजाती' => [
                'तामाङ', 'मगर', 'सुनुवार', 'नेवार', 'माझी', 'शेर्पा', 'हायु', 'पाहारी', 'लिम्बु',
                'जिरेल', 'थामी', 'भोटे', 'थकाली', 'व्याँसी', 'वालङु', 'छैरोतन', 'डोल्पो', 'ताङ्वे',
                'तिनगाउँले थकाली', 'बाह्रगाउँले थकाली', 'माफान्ली थकाली', 'ताकेगेला', 'मगुाली',
                'ल्होपा', 'ल्होमी (नशङसावा)', 'नायार (चमु्बा)', 'लाछे', 'ह्योल्मो', 'छन्त्याल', 'याख्या',
                'चोपाङ', 'थरुाम', 'सरेुल', 'कुमाल', 'राजी', 'राउटे', 'अन्य'
            ],

            'पहाडी अन्य' => [
                'बाहुन', 'क्षेत्री', 'ठकुरी', 'अन्य'
            ],

            'सन्यासी' => [
                'सन्यासी', 'अन्य'
            ],

            'तराई दलित' => [
                'मुसहर', 'चमार', 'मेस्तर', 'डोम', 'धोबी', 'कोरी', 'पथ्थरकट्टा', 'खनटक',
                'पासी', 'खत्वे', 'बाँतर', 'नचनिमार', 'जोम', 'सारिङ', 'तत्तमा', 'सोनार', 'लोहार',
                'नटुवा', 'पासवान', 'हजारा', 'रजक', 'मण्िल, खर्ग', 'मोची', 'हरिजन', 'मेस्तर (हलखोर)',
                'मरिक', 'सरवरिया', 'ताँती', 'र्ास', 'अन्य'
            ],

            'तराई जनजाती' => [
                'थारु', 'राजवांशी', 'धमाल', 'ताजपुरिया', 'कसान', 'मेचे', 'धानुक', 'झाँगी',
                'सतार', 'अन्य'
            ],

            'मधेसी ब्राह्मण/राजपुत' => [
                'झा', 'त्रिपाठी', 'मिश्र', 'शुक्ला', 'राजपुत', 'कायस्थ', 'मेचे (बोङो)', 'राजवांशी (कोच)',
                'सतार (सन्थाल)', 'गंगाई', 'अन्य'
            ],

            'मधेसी अन्य' => [
                'यादव', 'तेली', 'कलवार', 'सुथार', 'कुर्मी (कुमी)', 'हलवाई', 'हजाम', 'ठाकुर', 'सेनियार',
                'बढई', 'राजभर', 'केवट', 'मल्लाह', 'नुनिया', 'कुशवाह (कुशवाहा)', 'कोइरी', 'कुम्हार',
                'कहार', 'लोध', 'नवि / नबिण्डा', 'माली', 'कामार', 'धनुक', 'वराय', 'मणुष्या', 'बनिया',
                'पञ्जाबी', 'बंगाली', 'मारवाड़ी', 'नरुआँ', 'जैन', 'बनिया', 'अगड़ी', 'कठवानिया',
                'राजधोव', 'कुशवाहा', 'अन्य'
            ],

            'मुसलमान' => [
                'मुसलमान', 'अन्य'
            ],
        ];

        foreach ($casteData as $categoryName => $castes) {
            $category = CasteCategory::firstOrCreate(['name' => $categoryName]);

            foreach ($castes as $casteName) {
                Caste::firstOrCreate([
                    'name' => $casteName,
                    'caste_category_id' => $category->id,
                ]);
            }
        }
    }
}
